# 作者：g pc
# 开发时间：2024/12/19 23:58
import matplotlib.pyplot as plt
import numpy as np

X = np.linspace(0, 0.8, 100)  # X轴坐标数据
# # 巡航状态
# Y = ((0.98 * X - 0.189814)/0.044136) ** 0.5                # Y轴坐标数据
# Y1 = ((0.98 * X - 0.047024)/0.044136) ** 0.5                # Y轴坐标数据
# Y2 = ((0.98 * X - 0.069409)/0.044136) ** 0.5                # Y轴坐标数据
# Y3 = ((0.98 * X - 0.098903)/0.044136) ** 0.5                # Y轴坐标数据
# Y4 = ((0.98 * X - 0.142916)/0.044136) ** 0.5                # Y轴坐标数据

# # 起飞状态
# Y = ((0.98 * X - 0.101836)/0.048851) ** 0.5                # Y轴坐标数据
# Y1 = ((0.98 * X - 0.101463)/0.048851) ** 0.5                # Y轴坐标数据
# Y2 = ((0.98 * X - 0.101586)/0.048851) ** 0.5                # Y轴坐标数据
# Y3 = ((0.98 * X - 0.10167)/0.048851) ** 0.5                # Y轴坐标数据
# Y4 = ((0.98 * X - 0.10176)/0.048851) ** 0.5                # Y轴坐标数据

# # 降落状态
# Y1 = ((0.98 * X - 0.170433452)/0.048851) ** 0.5                # Y轴坐标数据
# Y2 = ((0.98 * X - 0.1706776)/0.048851) ** 0.5                # Y轴坐标数据
# Y3 = ((0.98 * X - 0.170832601)/0.048851) ** 0.5                # Y轴坐标数据
# Y4 = ((0.98 * X - 0.170989956)/0.048851) ** 0.5
# Y = ((0.98 * X - 0.171117805)/0.048851) ** 0.5

# 第二阶段爬升时单发停车状态
Y1 = ((0.98 * X - 0.075408086)/0.048851) ** 0.5                # Y轴坐标数据
Y2 = ((0.98 * X - 0.075652262)/0.048851) ** 0.5                # Y轴坐标数据
Y3 = ((0.98 * X - 0.075807234)/0.048851) ** 0.5                # Y轴坐标数据
Y4 = ((0.98 * X - 0.07596459)/0.048851) ** 0.5
Y = ((0.98 * X - 0.076092439)/0.048851) ** 0.5


# Y = np.linspace(-0.1, 0.8, 100)
# X0 = ((0.044136*Y ** 2) + 0.189814)/0.98
# X1 = ((0.044136*Y ** 2) + 0.047024)/0.98
# X2 = ((0.044136*Y ** 2) + 0.069409)/0.98
# X3 = ((0.044136*Y ** 2) + 0.098903)/0.98
# X4 = ((0.044136*Y ** 2) + 0.142916)/0.98



plt.plot(X, Y1, label='0.84')
plt.plot(X, Y2, label='0.8')
plt.plot(X, Y3, label='0.75')
plt.plot(X, Y4, label='0.7')
plt.plot(X, Y, label="0.62")            # 绘制曲线图

# plt.plot(X, Y3)
# plt.plot(X1,Y)
# plt.plot(X2,Y)
# plt.plot(X3,Y)
# plt.plot(X4,Y)
# plt.legend(loc='lower right', fancybox=True, framealpha=0.5, shadow=True, borderpad=1)

# 自动调整y轴坐标范围
# plt.autoscale_view()

#巡航状态
# plt.xlim(0, 0.8)
# plt.ylim(0.5, 5)

# 起飞状态
# plt.xlim(0.105, 0.11)
# plt.ylim(0.2, 0.3)

# #降落状态
# plt.xlim(0.198, 0.202)
# plt.ylim(0.7, 0.75)

#第二阶段爬升时单发停车状态
plt.xlim(0.098, 0.102)
plt.ylim(0.65, 0.7)

# plt.autoscale()


plt.legend(loc='lower right')
plt.xlabel("Cd")     # X轴标签
plt.ylabel("Cl")        # Y轴坐标标签
plt.rcParams['font.sans-serif'] = ['SimHei']  # 设置中文


plt.title("第二阶段爬升时单发停车极曲线放大")      #  曲线图的标题
#在ipython的交互环境中需要这句话才能显示出来
plt.savefig('第二阶段爬升时单发停车极曲线放大.png')


plt.show()

